{
  "nodes": [
    {
      "op": "null", 
      "name": "pf_features", 
      "attrs": {"__shape__": "(1, 36, 100)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "jnet0_ParticleNet_pfcand_batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0], [3, 0, 1], [4, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_conv3_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_conv3_fwd", 
      "attrs": {
        "dilate": "(1,)", 
        "kernel": "(1,)", 
        "layout": "NCW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,)", 
        "stride": "(1,)"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_batchnorm3_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_batchnorm3_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_batchnorm3_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_batchnorm3_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_batchnorm3_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 1], [11, 0, 1]]
    }, 
    {
      "op": "expand_dims", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_expand_dims0", 
      "attrs": {"axis": "3"}, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_tile0", 
      "attrs": {"reps": "(1, 1, 1, 16)"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_nearestneighborsfromindices0_transpose0", 
      "attrs": {"axes": "(0, 2, 1)"}, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "_arange", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_nearestneighborsfromindices0__arange0", 
      "attrs": {
        "dtype": "float32", 
        "infer_range": "False", 
        "repeat": "1", 
        "start": "1", 
        "step": "1.0", 
        "stop": "None"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_nearestneighborsfromindices0_reshape0", 
      "attrs": {"shape": "(-1, 1, 1)"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_nearestneighborsfromindices0_tile0", 
      "attrs": {"reps": "(1, 100, 16)"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_nearestneighborsfromindices0_expand_dims0", 
      "attrs": {"axis": "0"}, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "pf_mask", 
      "attrs": {"__shape__": "(1, 1, 100)"}, 
      "inputs": []
    }, 
    {
      "op": "_not_equal_scalar", 
      "name": "jnet0_ParticleNet_pfcand__not_equal_scalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "_equal_scalar", 
      "name": "jnet0_ParticleNet_pfcand__equal_scalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "jnet0_ParticleNet_pfcand__mulscalar0", 
      "attrs": {"scalar": "99.0"}, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "pf_points", 
      "attrs": {"__shape__": "(1, 2, 100)"}, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "jnet0_ParticleNet_pfcand_broadcast_add0", 
      "inputs": [[23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_batchdistancematrix0__mul0", 
      "inputs": [[25, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_batchdistancematrix0_sum0", 
      "attrs": {
        "axis": "1", 
        "keepdims": "True"
      }, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_batchdistancematrix0_transpose1", 
      "attrs": {"axes": "(0, 2, 1)"}, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_batchdistancematrix0_transpose0", 
      "attrs": {"axes": "(0, 2, 1)"}, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_batchdistancematrix0_batch_dot0", 
      "inputs": [[29, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_batchdistancematrix0__mulscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_batchdistancematrix0_broadcast_sub0", 
      "inputs": [[28, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_batchdistancematrix0__mul1", 
      "inputs": [[25, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_batchdistancematrix0_sum1", 
      "attrs": {
        "axis": "1", 
        "keepdims": "True"
      }, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_batchdistancematrix0_broadcast_add0", 
      "inputs": [[32, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "topk", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_topk0", 
      "attrs": {
        "axis": "-1", 
        "is_ascend": "True", 
        "k": "17", 
        "ret_typ": "indices"
      }, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_slice_axis0", 
      "attrs": {
        "axis": "-1", 
        "begin": "1", 
        "end": "None"
      }, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_nearestneighborsfromindices0_expand_dims1", 
      "attrs": {"axis": "0"}, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_nearestneighborsfromindices0_concat0", 
      "attrs": {
        "dim": "0", 
        "num_args": "2"
      }, 
      "inputs": [[19, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "gather_nd", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_nearestneighborsfromindices0_gather_nd0", 
      "inputs": [[15, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_nearestneighborsfromindices0_transpose1", 
      "attrs": {"axes": "(0, 3, 1, 2)"}, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "elemwise_sub", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0__minus0", 
      "inputs": [[41, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[14, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[45, 0, 0], [46, 0, 0], [47, 0, 0], [48, 0, 1], [49, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 64, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[51, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_batchnorm1_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[53, 0, 0], [54, 0, 0], [55, 0, 0], [56, 0, 1], [57, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_relu1_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[58, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_conv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 64, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_conv2_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[59, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_batchnorm2_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_batchnorm2_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_batchnorm2_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_batchnorm2_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_batchnorm2_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[61, 0, 0], [62, 0, 0], [63, 0, 0], [64, 0, 1], [65, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_relu2_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_mean0", 
      "attrs": {"axis": "-1"}, 
      "inputs": [[67, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0__plus0", 
      "inputs": [[12, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv0_relu3_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_conv3_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128, 64, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_conv3_fwd", 
      "attrs": {
        "dilate": "(1,)", 
        "kernel": "(1,)", 
        "layout": "NCW", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0,)", 
        "stride": "(1,)"
      }, 
      "inputs": [[70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_batchnorm3_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_batchnorm3_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_batchnorm3_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_batchnorm3_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_batchnorm3_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[72, 0, 0], [73, 0, 0], [74, 0, 0], [75, 0, 1], [76, 0, 1]]
    }, 
    {
      "op": "expand_dims", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_expand_dims0", 
      "attrs": {"axis": "3"}, 
      "inputs": [[70, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_tile0", 
      "attrs": {"reps": "(1, 1, 1, 16)"}, 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_nearestneighborsfromindices0_transpose0", 
      "attrs": {"axes": "(0, 2, 1)"}, 
      "inputs": [[70, 0, 0]]
    }, 
    {
      "op": "_arange", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_nearestneighborsfromindices0__arange0", 
      "attrs": {
        "dtype": "float32", 
        "infer_range": "False", 
        "repeat": "1", 
        "start": "1", 
        "step": "1.0", 
        "stop": "None"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_nearestneighborsfromindices0_reshape0", 
      "attrs": {"shape": "(-1, 1, 1)"}, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_nearestneighborsfromindices0_tile0", 
      "attrs": {"reps": "(1, 100, 16)"}, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_nearestneighborsfromindices0_expand_dims0", 
      "attrs": {"axis": "0"}, 
      "inputs": [[83, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "jnet0_ParticleNet_pfcand_broadcast_add1", 
      "inputs": [[23, 0, 0], [70, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_batchdistancematrix0__mul0", 
      "inputs": [[85, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_batchdistancematrix0_sum0", 
      "attrs": {
        "axis": "1", 
        "keepdims": "True"
      }, 
      "inputs": [[86, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_batchdistancematrix0_transpose1", 
      "attrs": {"axes": "(0, 2, 1)"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_batchdistancematrix0_transpose0", 
      "attrs": {"axes": "(0, 2, 1)"}, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_batchdistancematrix0_batch_dot0", 
      "inputs": [[89, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_batchdistancematrix0__mulscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[90, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_batchdistancematrix0_broadcast_sub0", 
      "inputs": [[88, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_batchdistancematrix0__mul1", 
      "inputs": [[85, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_batchdistancematrix0_sum1", 
      "attrs": {
        "axis": "1", 
        "keepdims": "True"
      }, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_batchdistancematrix0_broadcast_add0", 
      "inputs": [[92, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "topk", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_topk0", 
      "attrs": {
        "axis": "-1", 
        "is_ascend": "True", 
        "k": "17", 
        "ret_typ": "indices"
      }, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_slice_axis0", 
      "attrs": {
        "axis": "-1", 
        "begin": "1", 
        "end": "None"
      }, 
      "inputs": [[96, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_nearestneighborsfromindices0_expand_dims1", 
      "attrs": {"axis": "0"}, 
      "inputs": [[97, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_nearestneighborsfromindices0_concat0", 
      "attrs": {
        "dim": "0", 
        "num_args": "2"
      }, 
      "inputs": [[84, 0, 0], [98, 0, 0]]
    }, 
    {
      "op": "gather_nd", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_nearestneighborsfromindices0_gather_nd0", 
      "inputs": [[80, 0, 0], [99, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_nearestneighborsfromindices0_transpose1", 
      "attrs": {"axes": "(0, 3, 1, 2)"}, 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "elemwise_sub", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1__minus0", 
      "inputs": [[101, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[79, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128, 128, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[103, 0, 0], [104, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[105, 0, 0], [106, 0, 0], [107, 0, 0], [108, 0, 1], [109, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[110, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128, 128, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[111, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_batchnorm1_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[113, 0, 0], [114, 0, 0], [115, 0, 0], [116, 0, 1], [117, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_relu1_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[118, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_conv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128, 128, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_conv2_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[119, 0, 0], [120, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_batchnorm2_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_batchnorm2_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_batchnorm2_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_batchnorm2_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_batchnorm2_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[121, 0, 0], [122, 0, 0], [123, 0, 0], [124, 0, 1], [125, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_relu2_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[126, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_mean0", 
      "attrs": {"axis": "-1"}, 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1__plus0", 
      "inputs": [[77, 0, 0], [128, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "jnet0_ParticleNet_pfcand_edgeconv1_relu3_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[129, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "jnet0_ParticleNet_pfcand_broadcast_mul0", 
      "inputs": [[130, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "jnet0_ParticleNet_pfcand_mean0", 
      "attrs": {"axis": "-1"}, 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "sv_features", 
      "attrs": {"__shape__": "(1, 15, 7)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_sv_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_sv_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_sv_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_sv_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "jnet0_ParticleNet_sv_batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[133, 0, 0], [134, 0, 0], [135, 0, 0], [136, 0, 1], [137, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_conv3_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32, 0, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_conv3_fwd", 
      "attrs": {
        "dilate": "(1,)", 
        "kernel": "(1,)", 
        "layout": "NCW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0,)", 
        "stride": "(1,)"
      }, 
      "inputs": [[138, 0, 0], [139, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_batchnorm3_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_batchnorm3_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_batchnorm3_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_batchnorm3_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_batchnorm3_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[140, 0, 0], [141, 0, 0], [142, 0, 0], [143, 0, 1], [144, 0, 1]]
    }, 
    {
      "op": "expand_dims", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_expand_dims0", 
      "attrs": {"axis": "3"}, 
      "inputs": [[138, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_tile0", 
      "attrs": {"reps": "(1, 1, 1, 3)"}, 
      "inputs": [[146, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_nearestneighborsfromindices0_transpose0", 
      "attrs": {"axes": "(0, 2, 1)"}, 
      "inputs": [[138, 0, 0]]
    }, 
    {
      "op": "_arange", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_nearestneighborsfromindices0__arange0", 
      "attrs": {
        "dtype": "float32", 
        "infer_range": "False", 
        "repeat": "1", 
        "start": "1", 
        "step": "1.0", 
        "stop": "None"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_nearestneighborsfromindices0_reshape0", 
      "attrs": {"shape": "(-1, 1, 1)"}, 
      "inputs": [[149, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_nearestneighborsfromindices0_tile0", 
      "attrs": {"reps": "(1, 7, 3)"}, 
      "inputs": [[150, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_nearestneighborsfromindices0_expand_dims0", 
      "attrs": {"axis": "0"}, 
      "inputs": [[151, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "sv_mask", 
      "attrs": {"__shape__": "(1, 1, 7)"}, 
      "inputs": []
    }, 
    {
      "op": "_not_equal_scalar", 
      "name": "jnet0_ParticleNet_sv__not_equal_scalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "_equal_scalar", 
      "name": "jnet0_ParticleNet_sv__equal_scalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[154, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "jnet0_ParticleNet_sv__mulscalar0", 
      "attrs": {"scalar": "99.0"}, 
      "inputs": [[155, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "sv_points", 
      "attrs": {"__shape__": "(1, 2, 7)"}, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "jnet0_ParticleNet_sv_broadcast_add0", 
      "inputs": [[156, 0, 0], [157, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_batchdistancematrix0__mul0", 
      "inputs": [[158, 0, 0], [158, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_batchdistancematrix0_sum0", 
      "attrs": {
        "axis": "1", 
        "keepdims": "True"
      }, 
      "inputs": [[159, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_batchdistancematrix0_transpose1", 
      "attrs": {"axes": "(0, 2, 1)"}, 
      "inputs": [[160, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_batchdistancematrix0_transpose0", 
      "attrs": {"axes": "(0, 2, 1)"}, 
      "inputs": [[158, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_batchdistancematrix0_batch_dot0", 
      "inputs": [[162, 0, 0], [158, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_batchdistancematrix0__mulscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[163, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_batchdistancematrix0_broadcast_sub0", 
      "inputs": [[161, 0, 0], [164, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_batchdistancematrix0__mul1", 
      "inputs": [[158, 0, 0], [158, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_batchdistancematrix0_sum1", 
      "attrs": {
        "axis": "1", 
        "keepdims": "True"
      }, 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_batchdistancematrix0_broadcast_add0", 
      "inputs": [[165, 0, 0], [167, 0, 0]]
    }, 
    {
      "op": "topk", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_topk0", 
      "attrs": {
        "axis": "-1", 
        "is_ascend": "True", 
        "k": "4", 
        "ret_typ": "indices"
      }, 
      "inputs": [[168, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_slice_axis0", 
      "attrs": {
        "axis": "-1", 
        "begin": "1", 
        "end": "None"
      }, 
      "inputs": [[169, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_nearestneighborsfromindices0_expand_dims1", 
      "attrs": {"axis": "0"}, 
      "inputs": [[170, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_nearestneighborsfromindices0_concat0", 
      "attrs": {
        "dim": "0", 
        "num_args": "2"
      }, 
      "inputs": [[152, 0, 0], [171, 0, 0]]
    }, 
    {
      "op": "gather_nd", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_nearestneighborsfromindices0_gather_nd0", 
      "inputs": [[148, 0, 0], [172, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_nearestneighborsfromindices0_transpose1", 
      "attrs": {"axes": "(0, 3, 1, 2)"}, 
      "inputs": [[173, 0, 0]]
    }, 
    {
      "op": "elemwise_sub", 
      "name": "jnet0_ParticleNet_sv_edgeconv0__minus0", 
      "inputs": [[174, 0, 0], [147, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[147, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[176, 0, 0], [177, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[178, 0, 0], [179, 0, 0], [180, 0, 0], [181, 0, 1], [182, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[183, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32, 32, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[184, 0, 0], [185, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "jnet0_ParticleNet_sv_edgeconv0_batchnorm1_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
